Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
       + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-formatOutput will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-formatOutput" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-initQuery will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-initQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-concatStarter",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryVCF",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/svep-references",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginClinvar will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-pluginClinvar" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomad",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginConsequence will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-pluginConsequence" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginClinvar",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginGnomad will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-pluginGnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomad",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomadOneKG",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginGnomadConstraint will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-pluginGnomadConstraint" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-formatOutput",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomadConstraint",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginGnomadOneKG will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-pluginGnomadOneKG" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomadConstraint",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginGnomadOneKG",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-qcFigures will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-qcFigures" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002",
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/*",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryGTF will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-queryGTF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-pluginConsequence",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCF will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-queryVCF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryVCF",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryVCFsubmit",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCFsubmit will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-queryVCFsubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendClinicJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-updateReferenceFiles will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-updateReferenceFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250815040234752000000004",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:460722568061:svep-backend-updateReferenceFiles",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/svep-references",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::460722568061:role/svep_backend_ec2_references_instance_role",
            ]
        }
    }

  # module.svep[0].aws_dynamodb_table.svep_references will be updated in-place
  ~ resource "aws_dynamodb_table" "svep_references" {
        id                          = "svep-references"
        name                        = "svep-references"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].aws_iam_role_policy.ec2_references_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_references_policy" {
        id          = "svep_backend_ec2_references_instance_role:svep_backend_ec2_references_policy"
        name        = "svep_backend_ec2_references_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250815040234752000000004/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:460722568061:table/svep-references"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:9" -> (known after apply)
      ~ code_sha256                 = "J/eLKX9WX2KWkvGAMSXaccp6QIdr+8lPuNwr4A88rEQ=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-08-15T04:23:16.298+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:9" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "fS/eppR7Gsl5s0xrzfVoSS5pshJsFoevxXMY3VJWFC+/6c0c12qym7AO4ngiCz7UMU12TIw2hMcUaWu7ZXHlGA==" -> "IJ1Y7lgbRmoG/884OjFCZSALSJaiqFmYDMItgvc1mBHD9zyryb+yui059UdJK9RuZickHcV4TyNbr6tC8uv6ng==" # forces replacement
      ~ source_code_size            = 17950944 -> (known after apply)
      ~ version                     = "9" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].aws_s3_bucket.lambda-layers-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "lambda-layers-bucket" {
        id                          = "svep-backend-layers-20250815040234005900000003"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].aws_s3_bucket.svep-references will be updated in-place
  ~ resource "aws_s3_bucket" "svep-references" {
        id                          = "svep-backend-references-20250815040234752000000004"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].aws_s3_bucket.svep-regions will be updated in-place
  ~ resource "aws_s3_bucket" "svep-regions" {
        id                          = "svep-backend-regions-20250815040233979200000002"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].aws_s3_bucket.svep-results will be updated in-place
  ~ resource "aws_s3_bucket" "svep-results" {
        id                          = "svep-backend-results-20250815040235555500000005"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].aws_s3_bucket.svep-temp will be updated in-place
  ~ resource "aws_s3_bucket" "svep-temp" {
        id                          = "svep-backend-temp-20250815040233979100000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep[0].aws_sqs_queue.batch_submit_qld will be updated in-place
  ~ resource "aws_sqs_queue" "batch_submit_qld" {
        id                                = "https://sqs.ap-southeast-3.amazonaws.com/460722568061/svep-backend-batchSubmitDLQ"
        name                              = "svep-backend-batchSubmitDLQ"
      ~ tags                              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.svep[0].aws_sqs_queue.batch_submit_queue will be updated in-place
  ~ resource "aws_sqs_queue" "batch_submit_queue" {
        id                                = "https://sqs.ap-southeast-3.amazonaws.com/460722568061/svep-backend-batchSubmitQueue"
        name                              = "svep-backend-batchSubmitQueue"
      ~ tags                              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (19 unchanged attributes hidden)
    }

  # module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "s3_access_from_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::webgui-bucket-20250513021738584800000001/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::460722568061:distribution/E8Z5K385KM143",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.webgui.aws_cloudfront_distribution.bui-s3-distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "bui-s3-distribution" {
        id                              = "E8Z5K385KM143"
      ~ tags                            = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_bucket.bui-hosted-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "bui-hosted-bucket" {
        id                          = "webgui-bucket-20250513021738584800000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront will be updated in-place
  ~ resource "aws_s3_bucket_policy" "s3_access_from_cloudfront" {
        id     = "webgui-bucket-20250513021738584800000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::460722568061:distribution/E8Z5K385KM143"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::webgui-bucket-20250513021738584800000001/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.0.0-8-g939aa86" -> "v1.1.0-65-gbe463333+"
        id                            = "version.txt"
      ~ tags                          = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url will be updated in-place
  ~ resource "aws_ssm_parameter" "bui-ssm-beacon-ui-url" {
        id              = "bui-ssm-beacon-ui-url"
        name            = "bui-ssm-beacon-ui-url"
      ~ tags            = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "2522651683204420350" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "bf2df2eea929a3cc2617cda824b4ac20f14b576e" -> "4b8c0053faea54a3b6c83a742311435d63e15e7e"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "198888135352420537" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "bf2df2eea929a3cc2617cda824b4ac20f14b576e" -> "4b8c0053faea54a3b6c83a742311435d63e15e7e"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "532d5978-311a-fbf1-7896-c9d3eaff379a" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.0.0-8-g939aa86" -> "v1.1.0-65-gbe463333+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-customMessageLambdaTrigger"
        name              = "/aws/lambda/cognito-customMessageLambdaTrigger"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-customMessageLambdaTrigger"
        name                  = "cognito-customMessageLambdaTrigger"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-customMessageLambdaTrigger"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6941938284883894178" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1746415580480214200" -> "1756108131229981000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-logEmailDelivery"
        name              = "/aws/lambda/cognito-logEmailDelivery"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-logEmailDelivery"
        name                  = "cognito-logEmailDelivery"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-logEmailDelivery"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5394769549893669151" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1746415580102316000" -> "1756108131921662000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-sendClinicJobEmail"
        name              = "/aws/lambda/cognito-sendClinicJobEmail"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-sendClinicJobEmail"
        name                  = "cognito-sendClinicJobEmail"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendClinicJobEmail"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "602225773475477259" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755222278516512000" -> "1756108131729764000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-sendRegistrationEmail"
        name              = "/aws/lambda/cognito-sendRegistrationEmail"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-sendRegistrationEmail"
        name                  = "cognito-sendRegistrationEmail"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "265315220106969674" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755222278559631200" -> "1756108132460011000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/error-catcher-notifyOnError"
        name              = "/aws/lambda/error-catcher-notifyOnError"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "error-catcher"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "error-catcher-notifyOnError"
        name                  = "error-catcher-notifyOnError"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "error-catcher"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "error-catcher-notifyOnError:error-catcher-notifyOnError"
        name        = "error-catcher-notifyOnError"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cloudwatch:DescribeAlarms"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudwatch:ap-southeast-3:460722568061:alarm:error-catcher-notifyOnError"
                    },
                  - {
                      - Action   = [
                          - "events:enableRule",
                          - "events:disableRule",
                          - "events:describeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ap-southeast-3:460722568061:rule/error-catcher-notifyOnError-trigger"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::error-catcher-recent-errors-20250707235458704700000001"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::error-catcher-recent-errors-20250707235458704700000001/*"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:FilterLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-southeast-3:460722568061:log-group:/aws/lambda/*"
                    },
                  - {
                      - Action   = "ses:SendEmail"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ses:ap-southeast-3:460722568061:identity/*",
                          - "arn:aws:ses:ap-southeast-3:460722568061:configuration-set/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "error-catcher-notifyOnError"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "error-catcher"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7357891162307494868" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1755222278496779000" -> "1756108133043404200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "sbeacon-submitdataset-lambda-containers"
        name                 = "sbeacon-submitdataset-lambda-containers"
      ~ tags                 = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all             = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:3bd68e808dddb75d3498098675b2bdb096e5d3f4c8f461b93c2b6adc719a7d23460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:3bd68e808dddb75d3498098675b2bdb096e5d3f4c8f461b93c2b6adc719a7d23" -> (known after apply)
        name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:ffb76c00533dfad91eacbda1ebd84ac5a9b413d3bb10d32c69368a176a9bd2dd" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "274be9256bc33217b80e18a339bc0bd41a307b67" -> "15dc9b9bc282ff832f3ad6ffb55228cea885fa4b"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:810b300f59706ac6c29664c1b89665a276aa9d1597abcfb9002e1065f408a301" -> (known after apply)
        name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:810b300f59706ac6c29664c1b89665a276aa9d1597abcfb9002e1065f408a301" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "274be9256bc33217b80e18a339bc0bd41a307b67" -> "15dc9b9bc282ff832f3ad6ffb55228cea885fa4b"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-admin"
        name              = "/aws/lambda/sbeacon-backend-admin"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-admin"
        name                  = "sbeacon-backend-admin"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-admin:sbeacon-backend-admin-0"
        name        = "sbeacon-backend-admin-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cognito-idp:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-info",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-juptyer-notebooks",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:DescribeNotebookInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:460722568061:notebook-instance/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:460722568061:function:cognito-sendRegistrationEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/1d254f1da126bf493e7a1dcd597c2e81f10838b93271dc81771a6580d26a469d.zip" -> "builds/17ff32aa9bf57b5c9f996b78f05ce51a63a1b1cec104c63f3c98a174beb17bb2.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-08-15T04:33:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:11",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:8",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.